{"config": [{"config": {"kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "units": 20, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "name": "dense_1", "bias_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "batch_input_shape": [null, 12], "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "units": 30, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "name": "dense_2", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "units": 1, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "name": "dense_3", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "name": "batch_normalization_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_3", "activation": "tanh"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.0.0", "class_name": "Sequential"}