{"config": [{"config": {"bias_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_regularizer": null, "units": 20, "activity_regularizer": null, "name": "dense_1", "trainable": true, "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "dtype": "float32", "batch_input_shape": [null, 12], "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_regularizer": null, "units": 30, "activity_regularizer": null, "name": "dense_2", "trainable": true, "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_regularizer": null, "units": 1, "activity_regularizer": null, "name": "dense_3", "trainable": true, "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "scale": true, "trainable": true, "gamma_regularizer": null, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"activation": "tanh", "name": "activation_3", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.0"}